In [1]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn
np.random.seed(100)

In [13]:
randn(5,4)

array([[ 0.69012147,  0.68689007, -1.56668753,  0.90497412],
       [ 0.7788224 ,  0.42823287,  0.10887199,  0.02828363],
       [-0.57882582, -1.1994512 , -1.70595201,  0.36916396],
       [ 1.87657343, -0.37690335,  1.83193608,  0.00301743],
       [-0.07602347,  0.00395759, -0.18501411, -2.48715154]])

In [12]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [6]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
df['W']

A    1.618982
B    0.184519
C   -0.326238
D   -0.756352
E    1.189622
Name: W, dtype: float64

In [9]:
df[['X']] #displays like a dataframe

          X
A  1.541605
B  0.937082
C  0.055676
D  0.816454
E -1.690617

In [10]:
df.Y

A   -0.251879
B    0.731000
C    0.222400
D    0.750445
E   -1.356399
Name: Y, dtype: float64

In [26]:
df['new']=df['W']+df['Y'] #adding new column

In [27]:
df

          W         X         Y         Z       new
A -0.881798  0.018639  0.237845  0.013549 -0.643954
B -1.635529 -1.044210  0.613039  0.736205 -1.022491
C  1.026921 -1.432191 -1.841188  0.366093 -0.814267
D -0.331777 -0.689218  2.034608 -0.550714  1.702830
E  0.750453 -1.306992  0.580573 -1.104523  1.331027

In [28]:
df.drop('Z',axis=1)

          W         X         Y       new
A -0.881798  0.018639  0.237845 -0.643954
B -1.635529 -1.044210  0.613039 -1.022491
C  1.026921 -1.432191 -1.841188 -0.814267
D -0.331777 -0.689218  2.034608  1.702830
E  0.750453 -1.306992  0.580573  1.331027

In [29]:
df.drop('new',axis=1,inplace=True) #new is permanently removed

In [30]:
df

          W         X         Y         Z
A -0.881798  0.018639  0.237845  0.013549
B -1.635529 -1.044210  0.613039  0.736205
C  1.026921 -1.432191 -1.841188  0.366093
D -0.331777 -0.689218  2.034608 -0.550714
E  0.750453 -1.306992  0.580573 -1.104523

In [34]:
df.iloc[2] #display particular row

W    1.026921
X   -1.432191
Y   -1.841188
Z    0.366093
Name: C, dtype: float64

In [35]:
df>0

       W      X      Y      Z
A  False   True   True   True
B  False  False   True   True
C   True  False  False   True
D  False  False   True  False
E   True  False   True  False

In [36]:
df[df>0]

          W         X         Y         Z
A       NaN  0.018639  0.237845  0.013549
B       NaN       NaN  0.613039  0.736205
C  1.026921       NaN       NaN  0.366093
D       NaN       NaN  2.034608       NaN
E  0.750453       NaN  0.580573       NaN

In [37]:
df[df['W']>0]

          W         X         Y         Z
C  1.026921 -1.432191 -1.841188  0.366093
E  0.750453 -1.306992  0.580573 -1.104523

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.881798  0.018639  0.237845  0.013549
1     B -1.635529 -1.044210  0.613039  0.736205
2     C  1.026921 -1.432191 -1.841188  0.366093
3     D -0.331777 -0.689218  2.034608 -0.550714
4     E  0.750453 -1.306992  0.580573 -1.104523

In [40]:
newind='AA BB CC DD EE'.split()

In [43]:
df['Temp']=newind

In [44]:
df.set_index('Temp',inplace=True)

In [45]:
df

             W         X         Y         Z
Temp
AA   -0.881798  0.018639  0.237845  0.013549
BB   -1.635529 -1.044210  0.613039  0.736205
CC    1.026921 -1.432191 -1.841188  0.366093
DD   -0.331777 -0.689218  2.034608 -0.550714
EE    0.750453 -1.306992  0.580573 -1.104523

In [46]:
out=['G1','G1','G2','G2']
ins=[1,2,1,3]
hier_index=list(zip(out,ins))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [53]:
df2=pd.DataFrame(np.random.randn(4,2),index=hier_index,columns=['a','b'])

In [54]:
df2

             a         b
G1 1  0.317368 -0.752414
   2 -1.296392  0.095139
G2 1 -0.423715 -1.185984
   3 -0.365462 -1.271023

In [56]:
df2['a']

G1  1    0.317368
    2   -1.296392
G2  1   -0.423715
    3   -0.365462
Name: a, dtype: float64

In [62]:
df=df[df>0]
df

             W         X         Y         Z
Temp
AA         NaN  0.018639  0.237845  0.013549
BB         NaN       NaN  0.613039  0.736205
CC    1.026921       NaN       NaN  0.366093
DD         NaN       NaN  2.034608       NaN
EE    0.750453       NaN  0.580573       NaN

In [66]:
df.dropna(thresh=2) #drops the rows having more than 2 Nan

             W         X         Y         Z
Temp
AA         NaN  0.018639  0.237845  0.013549
BB         NaN       NaN  0.613039  0.736205
CC    1.026921       NaN       NaN  0.366093
EE    0.750453       NaN  0.580573       NaN

In [67]:
df.fillna(2) #fills 2 where there is NaN

             W         X         Y         Z
Temp
AA    2.000000  0.018639  0.237845  0.013549
BB    2.000000  2.000000  0.613039  0.736205
CC    1.026921  2.000000  2.000000  0.366093
DD    2.000000  2.000000  2.034608  2.000000
EE    0.750453  2.000000  0.580573  2.000000

In [68]:
#all these are not permanent changes. to make them permanent add inplace

In [72]:
data={'Company':['a','a','b','b','c','c'],
     'Person':['sam','sammy','tam','cam','pam','dam'],
     'Sales':[200,300,200,400,500,600]}
data

{'Company': ['a', 'a', 'b', 'b', 'c', 'c'],
 'Person': ['sam', 'sammy', 'tam', 'cam', 'pam', 'dam'],
 'Sales': [200, 300, 200, 400, 500, 600]}

In [73]:
df3=pd.DataFrame(data)
df3

  Company Person  Sales
0       a    sam    200
1       a  sammy    300
2       b    tam    200
3       b    cam    400
4       c    pam    500
5       c    dam    600

In [77]:
df3.describe()

            Sales
count    6.000000
mean   366.666667
std    163.299316
min    200.000000
25%    225.000000
50%    350.000000
75%    475.000000
max    600.000000